{
    "tw.alerts.autosaving": "Creazione del punto di ripristino...",
    "tw.alerts.lostPeripheralConnection": "Persa la connessione a {extensionName}.",
    "tw.alerts.savedToDisk": "Salvato sul computer.",
    "tw.backpack.rename": "Nuovo nome:",
    "tw.blocks.buttonIsDown": "pulsante [MOUSE_BUTTON] del mouse premuto",
    "tw.blocks.lastKeyPressed": "ultimo tasto premuto",
    "tw.blocks.mouseButton.middle": "(1) centrale",
    "tw.blocks.mouseButton.primary": "(0) primario",
    "tw.blocks.mouseButton.secondary": "(2) secondario",
    "tw.blocks.openDocs": "Documentazione Open",
    "tw.browserModal.desc": "Assicurati di usare una versione recente di Google Chrome, Mozilla Firefox, Microsoft Edge o Apple Safari.",
    "tw.cantUseCloud": "Sebbene tu possa creare variabili cloud, queste funzioneranno solo quando il progetto sarà stato caricato sul sito di Scratch o sarà stato convertito usando un tool come {packager}.",
    "tw.changeUsername.cannotChangeWhileRunning": "Non è possibile cambiare lo username mentre il progetto è in esecuzione.",
    "tw.cloudVariableBadge": "Questo progetto usa le variabili cloud. TurboWarp usa un proprio server di variabili cloud indipendente da Scratch. Nota che gli utenti potrebbero non essere chi detto dal loro username in quanto chiunque può cambiare il proprio username in quello che preferisce. {learnMore}",
    "tw.code": "Codice Sorgente",
    "tw.confirmIncompatibleExtension": "Questa estensione non è compatibile con Scratch. I progetti che vengono creati con essa non possono essere caricati sul sito di Scratch. Sei sicuro di volerla attivare?",
    "tw.customExtension.description": "Carica le estensioni personalizzate usando Il loro URL. Per sviluppatori. Sperimentale.",
    "tw.customExtension.name": "Estensioni Personalizzate",
    "tw.featuredProjectsStudio": "Vai alla galleria sul sito di Scratch.",
    "tw.feedback": "Feedback & Bug",
    "tw.feedbackButton": "Feedback per TurboWarp",
    "tw.footer.credits": "Crediti",
    "tw.footer.disclaimer": "TurboWarp non è affiliato a Scratch, allo Scratch Team o alla Scratch Foundation.",
    "tw.footer.donate": "Dona",
    "tw.footer.embed": "Inclusione",
    "tw.footer.fosshost": "Hosting fornito da Fosshost",
    "tw.footer.parameters": "Parametri URL",
    "tw.footer.translate": "Aiuta a Tradurre TurboWarp",
    "tw.gui.crashMessage.description": "Ci dispiace, sembra che la pagina abbia avuto un arresto anomalo. Aggiorna la pagina per riprovare.",
    "tw.gui.defaultProjectTitle": "Progetto",
    "tw.guiDefaultTitle": "Esegue i progetti Scratch più velocemente",
    "tw.home.credit": "Note e Crediti",
    "tw.home.description": "TurboWarp è una Modifica di Scratch che compila i progetti in JavaScript per renderli molto più veloci. Provalo, inserisci qui sopra un ID di un progetto o una URL o scegli uno dei progetti in primo piano che trovi qui sotto.",
    "tw.home.instructions": "Istruzioni",
    "tw.input.tooltip": "Copia e incolla il link di un progetto Scratch qui!",
    "tw.interpolationEnabled": "Interpolazione",
    "tw.invalidParameters.clones": "Il parametro URL \"clone\" non è valido",
    "tw.invalidParameters.fps": "Il parametro URL \"fps\" non è valido",
    "tw.loadError": "Errore nel caricamento del progetto: {error}",
    "tw.loader.assets.known": "Scaricamento risorse in corso ({complete}/{total}) ...",
    "tw.loader.assets.unknown": "Scaricamento risorse in corso ...",
    "tw.loader.data": "Scaricamento dati del progetto in corso...",
    "tw.loader.generic": "Caricamento del progetto in corso …",
    "tw.menuBar.60off": "Disabilita modalità 60 FPS",
    "tw.menuBar.60on": "Abilita modalità 60 FPS",
    "tw.menuBar.addons": "Addon",
    "tw.menuBar.advanced": "Impostazioni Avanzate",
    "tw.menuBar.changeUsername": "Cambia Username",
    "tw.menuBar.cloudOff": "Disabilita Variabili Cloud",
    "tw.menuBar.cloudOn": "Abilita Variabili Cloud",
    "tw.menuBar.cloudUnavailable": "Le Variabili Cloud non sono Disponibili",
    "tw.menuBar.cloudUnavailableAlert": "Impossibile usare le variabili cloud, probabilmente perché è stato aperto l'editor.",
    "tw.menuBar.loadRestorePoint": "Carica il punto di ripristino",
    "tw.menuBar.moreSettings": "Impostazioni Avanzate",
    "tw.menuBar.newFramerate": "Nuovo framerate:",
    "tw.menuBar.package": "Crea pacchetto",
    "tw.menuBar.reportError1": "Non è stato possibile compilare tutti gli script.",
    "tw.menuBar.reportError2": "Si è verificato un problema. Ti invitiamo a segnalarlo.",
    "tw.menuBar.saveAs": "Salva come {file}",
    "tw.menuBar.seeInside": "Guarda dentro",
    "tw.oldDownload": "Salve in un file separato...",
    "tw.openAdvanced": "Apri impostazioni avanzate",
    "tw.paint.alpha": "Opacità",
    "tw.privacy": "Politica della Privacy",
    "tw.restorePoint.confirm": "L'editor memorizza un punto di ripristino automatico in caso qualcosa non vada per il verso giusto e tu abbia dimenticato di salvare. Non dovresti fare affidamento su questa funzionalità e non possiamo garantirti che potrai recuperare il tuo progetto. Vuoi provare a caricarlo?",
    "tw.restorePoint.loadFail": "Impossibile caricare il punto di ripristino: {error}",
    "tw.saveAs": "Salva come...",
    "tw.saveTo": "Salva come {file}",
    "tw.scratchUnsafeCloud": "Se crei questa variabile cloud, il progetto supererà il limite massimo di {number} variabili previsto da Scratch e alcune variabili non funzioneranno se caricerai il progetto sul sito di Scratch.",
    "tw.settingsModal.customStageSize": "Dimensioni Stage Personalizzate:",
    "tw.settingsModal.customStageSizeHelp": "Cambia la dimensione dello stage di Scratch da 480x360 a un altro valore. Prova 640x360 per rendere lo stage widescreen. Pochi progetti potranno gestire questa proprietà.",
    "tw.settingsModal.dangerZone": "Zona Pericolosa",
    "tw.settingsModal.disableCompiler": "Disabilita Compilatore",
    "tw.settingsModal.disableCompilerHelp": "Disabilita il compilatore di TurboWarp. E' un'opzione utile soltanto quando si modificano i progetti, in modo che gli script si aggiornino immediatamente. Si sconsiglia di usare questa opzione in altri casi.",
    "tw.settingsModal.featured": "In Evidenza",
    "tw.settingsModal.fps": "60 FPS (FPS personalizzato)",
    "tw.settingsModal.fpsHelp": "Esegue gli script 60 volte al secondo invece di 30. Alcuni progetti potrebbero non funzionare correttamente con questa impostazione abilitata. In questo caso puoi provare ad abilitare l'interpolazione senza abilitare la modalità 60 FPS. {customFramerate}.",
    "tw.settingsModal.fpsHelp.customFramerate": "Clicca qui per usare un framerate diverso da 30 o 60",
    "tw.settingsModal.help": "Clicca per aiuto",
    "tw.settingsModal.highQualityPen": "Penna Alta Qualità",
    "tw.settingsModal.highQualityPenHelp": "Permette ai progetti di essere visualizzati ad una risoluzione maggiore e disabilita l'arrotondamento delle coordinate fatto dall'editor. Non tutti i progetti si giovano di questa impostazione che può avere impatto sulla performance del progetto.",
    "tw.settingsModal.infiniteClones": "Cloni Infiniti",
    "tw.settingsModal.infiniteClonesHelp": "Disabilita il limite di Scratch di 300 cloni.",
    "tw.settingsModal.interpolation": "Interpolazione",
    "tw.settingsModal.interpolationHelp": "Fa apparire i progetti più fluidi interpolando il movimento degli sprite. L'interpolazione non dovrebbe essere usata nei progetti 3D, nei raytracer, nei progetti basati sull'uso della penna e nei progetti che laggano in quanto l'interpolazione li farebbe eseguire più lentamente senza farli apparire più fluidi.",
    "tw.settingsModal.largeStageWarning": "L'uso di uno stage personalizzato così grande non è raccomandato! Ti suggeriamo di usare una dimensione inferiore con le stesse proporzioni e usare poi il fullscreen per portarlo alle dimensioni dello schermo dell'utente.",
    "tw.settingsModal.removeFencing": "Rimozione Recinto",
    "tw.settingsModal.removeFencingHelp": "Permette agli sprite di muoversi completamente fuori dallo Stage e di diventare grandi o piccoli quando si desidera e permette ai blocchi sensori che verificano il contatto di funzionare anche quando gli sprite sono completamente fuori dallo Stage.",
    "tw.settingsModal.removeLimits": "Rimozione Limiti",
    "tw.settingsModal.removeMiscLimits": "Rimozione Limiti Vari",
    "tw.settingsModal.removeMiscLimitsHelp": "Rimuove i limiti agli effetti sonori e alla dimensione della penna.",
    "tw.settingsModal.storeProjectOptions": "Memorizza le impostazioni nel progetto",
    "tw.settingsModal.storeProjectOptionsHelp": "Memorizza nel progetto le impostazioni selezionate in modo che siano applicate automaticamente quando il progetto viene caricato in TurboWarp. Il warp timer e la disabilitazione del compilatore non verranno memorizzati.",
    "tw.settingsModal.title": "Impostazioni Avanzate",
    "tw.settingsModal.warpTimerHelp": "Permette ai progetti di verificare se sono bloccati in un loop molto lungo o infinito e di essere quindi eseguiti ad un framerate più basso invece di apparire bloccati fino a che il loop non termina. Questa opzione risolve molte cause di blocco ma ha un impatto significativo sulla performance, quindi è abilitata come impostazione predeterminata solo all'interno dell'editor.",
    "tw.spriteSelectorItem.rename": "rinomina",
    "tw.stereoAlert": "Modificando questo suono stereo verrà convertito in modo in maniera irreversibile. ",
    "tw.studioview.authorAttribution": "di {author}",
    "tw.studioview.error": "Si è verificato un errore nel caricamento della pagina di progetti successiva.",
    "tw.studioview.hoverText": "{title} di {author}",
    "tw.tooLarge": "Questo suono potrebbe essere troppo pesante per essere caricato su Scratch.",
    "tw.twExtension.description": "Nuovi blocchi strani. Non compatibile con Scratch.",
    "tw.twExtension.name": "Blocchi TurboWarp",
    "tw.unshared.1": "I progetti non convidisi non saranno più accessibili in futuro tramite il loro ID a causa di cambiamenti alla API di Scratch.",
    "tw.unshared.2": "Per ulteriori informazioni vai a {link}",
    "tw.unshared.cache": "Se il progetto è stato condiviso di recente questo messaggio può apparire erroneamente per alcuni minuti.",
    "tw.usernameModal.help": "Questo valore verrà archiviato nello spazio di archiviazione del tuo browser. Potrebbe essere loggato quando interagisci con progetti che usano le variabili cloud.",
    "tw.usernameModal.help2": "Valori che non corrispondono ad un account Scratch valido saranno di solito rifiutati dal server delle variabili cloud. Raccomandiamo di lasciarli così come sono o cambiandolo nel tuo username Scratch.",
    "tw.usernameModal.mustChange": "Il server delle variabili cloud pensa che il tuo username possa non essere sicuro. Ti preghiamo di cambiarlo con qualcos'altro o di {resetIt}",
    "tw.usernameModal.mustChange.resetIt": "resettarlo (raccomandato)",
    "tw.usernameModal.reset": "Resetta",
    "tw.usernameModal.title": "Cambia Username",
    "tw.viewFeaturedProjects": "Clicca per vedere i progetti in primo piano.",
    "tw.viewOnScratch": "Mostra il progetto nel sito di Scratch",
    "tw.webglModal.description": "Sembra che il tuo browser o il tuo computer non siano compatibili con {webGlLink}. Questa tecnologia è necessaria per poter usare questo sito. Prova ad aggiornare il tuo browser e i tuoi driver video o a riavviare il tuo computer."
}